Repository: rasulsafin/second_dm_test
Catalog: Brio.Docs.Api/Resources/SharedLocalization.*.resx
Languages: ru

# CheckValidConnectionTypeID_Missing
source: Could not find requested connection type
ru: Не удалось найти тип подключения

# CheckValidConnectionTypeToCreate_AlreadyExists
source: This name is already being used by different conention type
ru: Имя уже используется другим типом подключения

# CheckValidID_DefaultErrorMessage
source: Invalid ID
ru: Недействительный ID

# CheckValidItemID_Missing
source: Could not find requested item
ru: Не удалось найти файл

# CheckValidJobId_Missing
source: Could not find requested job
ru: Не удалось найти запрашиваемую задачу

# CheckValidObjectiveID_Missing
source: Could not find requested objective
ru: Не удалось найти задачу

# CheckValidObjectiveTypeID_Missing
source: Could not find requested objective type
ru: Не удалось найти тип задачи

# CheckValidProjectID_Missing
source: Could not find requested project
ru: Не удалось найти проект

# CheckValidUserID_Missing
source: Could not find requested user
ru: Не удалось найти пользователя

# CheckValidUserToCreate_AlreadyExists
source: This login is already being used
ru: Логин уже используется другим пользователем

source: Could not connect
ru: Не удалось подключиться

# CouldNotDownload
source: Could not download files
ru: Не удалось загрузить файлы

source: Could not synchronize
ru: Синхронизация не удалась

source: Failed to create report
ru: Не удалось создать отчет

# JobIsUnfinished
source: Requested job is not finished yet
ru: Задача еще не завершена

source: Method is not implemented
ru: Отсутсутствует реализация метода

source: Server error
ru: Ошибка сервера

# ServerError_Add
source: Failed to add data to the table
ru: Не удалось добавить данные в таблицу

# ServerError_Delete
source: Failed to delete data from the table
ru: Не удалось удалить данные из таблицы

# ServerError_Get
source: Failed to retrieve information from the server
ru: Не удалось получить данные с сервера

# ServerError_Put
source: Failed to update data
ru: Не удалось обновить данные

# SomethingIsMissing
source: Object could not be found
ru: Не удалось найти объект

# UserHasNoRoleAlready
source: User does not have this role already
ru: У пользователя уже нет данной роли

# UserHasRoleAlready
source: User already has this role
ru: Пользователю уже присвоена данная роль

# ValidationError_IdIsRequired
source: Id should not be empty
ru: Ключ не может быть пустым

# ValidationError_JobIdRequired
source: Task id should not be empty
ru: Идентификатор задачи не может быть пустым

# ValidationError_LoginIsRequired
source: Login should not be empty
ru: Логин не должен быть пустым

# ValidationError_ObjectiveNameIsRequired
source: Objective name should not be empty
ru: Имя задачи не должно быть пустым

# ValidationError_ObjectiveTypeNameIsRequired
source: Objective type name should not be null
ru: Имя типа не должно быть пустым

# ValidationError_ObjectRequired_Add
source: Could not add empty objects
ru: Нельзя добавлять пустые объекты

# ValidationError_ObjectRequired_Put
source: Could not update empty objects
ru: Нельзя обновлять пустые объекты

# ValidationError_PasswordIsRequired
source: Password should not be empty
ru: Пaроль не должен быть пустым

# ValidationError_PathIsRequired
source: Path should not be empty
ru: Путь не должен быть пустым

# ValidationError_ProjectNameIsRequired
source: Project name is required
ru: Название проекта не должно быть пустым

source: Wrong password
ru: Неправильный пароль

# CheckValidObjectiveTypeNameToAdd_AlreadyExists
source: The objective type with the same name already exists
ru: Тип задач с таким именем уже существует

# CheckValidProjectTitleToAdd_TitleRequired
source: Project title is required
ru: Название проекта не должно быть пустым

# ValidationError_PageNumberTooSmall
source: Page number should be greater than zero
ru: Номер страницы должен быть больше нуля

# ValidationError_PageSizeNotInRange
source: Page size is not in valid range
ru: Недопустимый размер страницы

# FailedToUploadFiles
source: Could not upload files
ru: Не удалось загрузить файлы на облако
